cf/Catalogs/AutomaticDiscounts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>AutomaticDiscounts</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Acts</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AssignmentMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountsMarkupsProvidingWays</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Purpose</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AssignAutomaticDiscounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AssignmentArea</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountMarkupRestrictionAreasVariants</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountMarkupValue</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RestrictionByProductsAndServicesVariant</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountRestrictionVariantsByProductsAndServices</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsRestrictionOnRecipientsCounterparties</Name>
					<Comment>By counterparties (wholesale) or warehouses (retail).</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsRestrictionByRecipientsWarehouses</Name>
					<Comment>(Retail)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ThereIsSchedule</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalOrderingAttribute</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClarificationByProductsAndServices</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClarificationByProductsAndServicesCategories</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClarificationByPriceGroups</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AssignmentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SharedUsageVariant</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountsMarkupsSharedUsageOptions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Comment>Any additional information</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ThereAreFoldersToBeClarifiedByProductsAndServices</Name>
					<Comment>(Wholesale)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>TimeByDaysOfWeek</Name>
					<Comment>Discount lifetime</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Selected</Name>
							<Comment>(Common) Shows a selected day of the week</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>WeekDay</Name>
							<Comment>(Common) Day of the week</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.WeekDays</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BeginTime</Name>
							<Comment>(Common) Discount validity start time</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EndTime</Name>
							<Comment>(Common) Discount expiration time</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ProductsAndServicesGroupsPriceGroups</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ValueClarification</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesCategories</v8:Type>
								<v8:Type>cfg:CatalogRef.PriceGroups</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DiscountMarkupValue</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ConditionsOfAssignment</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>AssignmentCondition</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DiscountsMarkupsProvidingConditions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DiscountRecipientsCounterparties</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Recipient</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DiscountRecipientsWarehouses</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Recipient</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/DiscountsMarkupsSharedUsageOptions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>DiscountsMarkupsSharedUsageOptions</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Exclusion</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Minimum</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Max</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Addition</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Multiplication</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/AutomaticDiscounts/Forms/GroupForm/Ext/Form/Module.bsl
#Region FormEventsHandlers

// Procedure - OnCreateAtServer event handler.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	AllowedEditDocumentPrices = SmallBusinessAccessManagementReUse.AllowedEditDocumentPrices();
	ThisForm.ReadOnly = Not AllowedEditDocumentPrices;
	
	If Parameters.Key = Undefined Or Parameters.Key.IsEmpty() Then
		
		If Object.SharedUsageVariant.IsEmpty() Then
			Object.SharedUsageVariant = Enums.DiscountsMarkupsSharedUsageOptions.Max;
		EndIf;
		Object.Description = String(Object.SharedUsageVariant);
		
	EndIf;
	
EndProcedure

#EndRegion

#Region FormItemEventsHandlers

// Procedure - event handler OnChange item DiscountsSharedUsageOption.
//
&AtClient
Procedure SharedUsageVariantOfDiscountChargeOnChange(Item)
	
	If IsBlankString(Object.Description) Then
		Object.Description = String(Object.SharedUsageVariant);
	Else
		For Each ItemOfList IN Items.SharedUsageVariantOfDiscountCharge.ChoiceList Do
			If String(ItemOfList.Value) = Object.Description Then
				Object.Description = String(Object.SharedUsageVariant);
				Break;
			EndIf;
		EndDo;
	EndIf;
	
EndProcedure

#EndRegion
